validation/moldCHT/constant/cavity/moldingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Fluid region moulding dictionary: the CHT benchmark is a quiescent
    conduction problem, so the process groups are inert and ejection is
    unreachable.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/cavity";
    object      moldingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    meltTemperature  480;
}

packing
{
    switchFraction   1;
    switchPressure   1e9;

    pressure
    {
        type            constant;
        value           1e5;
    }
}

cooling
{
    ejectionTemperature  100;
    releasePressure      1e5;
}

viscousDissipation  false;

// ************************************************************************* //
